; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph0 - mode
	spectrograph5 - mode
	image3 - mode
	image1 - mode
	infrared2 - mode
	infrared4 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	Star10 - direction
	Star9 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 infrared4)
	(supports instrument0 image1)
	(supports instrument0 image3)
	(supports instrument0 spectrograph5)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star9)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
)
(:goal (and
	(have_image Star11 image1)
	(have_image Star11 image3)
	(have_image Star12 infrared2)
	(have_image Phenomenon13 spectrograph5)
	(have_image Phenomenon13 infrared2)
	(have_image Planet14 image3)
	(have_image Planet14 thermograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (calibrate satellite0 instrument0 star9)
   added: (calibrated instrument0)
   goals met: 0 of 7
3. (turn_to satellite0 phenomenon13 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon13)
   goals met: 0 of 7
4. (take_image satellite0 phenomenon13 instrument0 infrared2)
   added: (have_image phenomenon13 infrared2)
   goals met: 1 of 7
5. (take_image satellite0 phenomenon13 instrument0 spectrograph5)
   added: (have_image phenomenon13 spectrograph5)
   goals met: 2 of 7
6. (turn_to satellite0 planet14 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet14)
   goals met: 2 of 7
7. (take_image satellite0 planet14 instrument0 image3)
   added: (have_image planet14 image3)
   goals met: 3 of 7
8. (take_image satellite0 planet14 instrument0 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 4 of 7
9. (turn_to satellite0 star11 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star11)
   goals met: 4 of 7
10. (take_image satellite0 star11 instrument0 image1)
   added: (have_image star11 image1)
   goals met: 5 of 7
11. (take_image satellite0 star11 instrument0 image3)
   added: (have_image star11 image3)
   goals met: 6 of 7
12. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 6 of 7
13. (take_image satellite0 star12 instrument0 infrared2)
   added: (have_image star12 infrared2)
   goals met: 7 of 7
